const shlokasData = [
  "पाञ्चजन्यं हृषीकेशो देवदत्तं धनञ्जयः ।पौण्ड्रं दध्मौ महाशङ्खं भीमकर्मा वृकोदरः ॥ १-१५॥",

  "अनन्तविजयं राजा कुन्तीपुत्रो युधिष्ठिरः ।नकुलः सहदेवश्च सुघोषमणिपुष्पकौ ॥ १-१६॥",

  "न काङ्क्षे विजयं कृष्ण न च राज्यं सुखानि च ।किं नो राज्येन गोविन्द किं भोगैर्जीवितेन वा ॥ १-३२॥",

  "येषामर्थे काङ्क्षितं नो राज्यं भोगाः सुखानि च ।त इमेऽवस्थिता युद्धे प्राणांस्त्यक्त्वा धनानि च ॥ १-३३॥",

  "कुलक्षये प्रणश्यन्ति कुलधर्माः सनातनाः ।धर्मे नष्टे कुलंकृत्स्नमधर्मोऽभिभवत्युत ॥ १-४०॥",

  "उत्सन्नकुलधर्माणां मनुष्याणां जनार्दन ।नरके नियतं वासो भवतीत्यनुशुश्रुम ॥ १-४४॥",
  // Chapter 1 done..................
  "क्लैब्यं मा स्म गमः पार्थ नैतत्त्वय्युपपद्यते ।क्षुद्रं हृदयदौर्बल्यं त्यक्त्वोत्तिष्ठ परन्तप ॥ २-३॥",

  "नासतो विद्यते भावो नाभावो विद्यते सतः ।उभयोरपि दृष्टोऽन्तस्त्वनयोस्तत्त्वदर्शिभिः ॥ २-१६॥",

  "वासांसि जीर्णानि यथा विहाय नवानि गृह्णाति नरोऽपराणि ।तथा शरीराणि विहाय जीर्णा-न्यन्यानि संयाति नवानि देही ॥ २-२२॥",

  "स्वधर्ममपि चावेक्ष्य न विकम्पितुमर्हसि ।धर्म्याद्धि युद्धाच्छ्रेयोऽन्यत्क्षत्रियस्य न विद्यते ॥ २-३१॥",

  "सुखदुःखे समे कृत्वा लाभालाभौ जयाजयौ ।ततो युद्धाय युज्यस्व नैवं पापमवाप्स्यसि ॥ २-३८॥",

  "भोगैश्वर्यप्रसक्तानां तयापहृतचेतसाम् ।व्यवसायात्मिका बुद्धिः समाधौ न विधीयते ॥ २-४४॥",

  "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन ।मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि ॥ २-४७॥",

  "दूरेण ह्यवरं कर्म बुद्धियोगाद्धनञ्जय । बुद्धौ शरणमन्विच्छकृपणाः फलहेतवः ॥ २-४९॥",

  "यदा संहरते चायं कूर्मोऽङ्गानीव सर्वशः ।इन्द्रियाणीन्द्रियार्थेभ्यस्तस्य प्रज्ञा प्रतिष्ठिता ॥२-५८॥",

  "विषया विनिवर्तन्ते निराहारस्य देहिनः । रसवर्जं रसोऽप्यस्य परं दृष्ट्वा निवर्तते ॥ २-५९॥",

  "तानि सर्वाणि संयम्य युक्त आसीत मत्परः ।वशे हि यस्येन्द्रियाणि तस्य प्रज्ञा प्रतिष्ठिता ॥ २-६१॥",

  "प्रसादे सर्वदुःखानां हानिरस्योपजायते ।प्रसन्नचेतसो ह्याशु बुद्धिः पर्यवतिष्ठते ॥ २-६५॥",

  "या निशा सर्वभूतानां तस्यां जागर्ति संयमी ।यस्यां जाग्रति भूतानि सा निशा पश्यतो मुनेः ॥ २-६९॥",
  // Chapter 2 Done ...........

  // Add more shlokas as needed
];

const shlokaContainer = document.getElementById("shloka-container");

// Function to display a random Shloka
function displayRandomShloka() {
  const randomIndex = Math.floor(Math.random() * shlokasData.length);
  const shloka = shlokasData[randomIndex];

  shlokaContainer.textContent = shloka;
}

// Display a random Shloka when the page is loaded
displayRandomShloka();

// Reload a random Shloka when the page is clicked
document.addEventListener("click", displayRandomShloka);
